# -*- coding:utf-8 -*-
# 问题：某个公司采用公用电话传递数据，数据是四位的整数，在传递过程中是加密的。
#      加密规则如下：每位数字都加上5,然后用和除以10的余数代替该数字，
#      再将第一位和第四位交换，第二位和第三位交换。输入一个数字，输出加密后的数字。
num = int(input('please input a number(四位数)：'))
num_1 = num % 10  # 最低位
num_2 = num//10 % 10  # 倒数第二位
num_3 = num//100 % 10  # 倒数第三位
num_4 = num//1000  # 最高位
num_1 = (num_1+5) % 10
num_2 = (num_2+5) % 10
num_3 = (num_3+5) % 10
num_4 = (num_4+5) % 10
num_4, num_1 = num_1, num_4
num_2, num_3 = num_3, num_2
print('加密后的数字为：%d' % (num_4*1000+num_3*100+num_2*10+num_1))


# 还可以将结果放入一个list，对list执行操作
